// import $axios from "@/plugins/axios";

const musics = {
  namespaced: true,

  state: {
    all_musics: [
      {
        id: 10,
        name: "ندارمت",
        img: "Mohsen-Yeganeh-Nadaramet.jpg",
        singer: "محسن یگانه",
        isLike: false,
        source: "Mohsen Yeganeh - Nadaramet.mp3",
        duration: 228,
        lyric: `بدون همیشه و هنوز یه دردی از تو با منه
          قلبم به محض رفتنت مرد و دیگه نمیزنه
          روا نبود که گم بشم لابه لای خاطرات
          رسمش این نبود ولی کهنه شد چه زود برات
          موند به قلبم حسرتش به دست بیارمت ولی عشق همینی هست که هست
          بخوام نخوام ندارمت ...
          این همه گذشت و باز تازه موند برام غمت ای کاش میشد برم عقب
          ای کاش ندیده بودمت ...
          موند به قلبم حسرتش به دست بیارمت ولی عشق همینی هست که هست
          بخوام نخوام ندارمت ...
          این همه گذشت و باز تازه موند برام غمت ای کاش میشد برم عقب
          ای کاش ندیده بودمت ...
          موند به قلبم حسرتش به دست بیارمت ولی عشق همینی هست که هست
          بخوام نخوام ندارمت ...
          برگرد به خونه ی دلم که آخرای جونشه از غم میخونن آجراش
          چه حسرتی ستونشه ...
          آتیشه رفتنت هنوز نور خونه ی منه یه قاصدک رو پشت بوم یه جغد رو شونه ی منه
          ساعتاش رو دور کند چشم تو چشم انتظار خودم نرم تو مشت سرنوشت گوش به حرف روزگار
          روز به روز غریبه تر با آدماش بدون حس گذشته و گذشت بیا باش به داد من برس
          موند به قلبم حسرتش به دست بیارمت ولی عشق همینی هست که هست
          بخوام نخوام ندارمت ...
          این همه گذشت و باز تازه موند برام غمت ای کاش میشد برم عقب
          ای کاش ندیده بودمت ...
          موند به قلبم حسرتش به دست بیارمت ولی عشق همینی هست که هست
          بخوام نخوام ندارمت ...
          این همه گذشت و باز تازه موند برام غمت ای کاش میشد برم عقب
          ای کاش ندیده بودمت ...`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2019 17:58:00"),
      },
      {
        id: 12,
        name: "شاخه نبات",
        img: "Masih-Arash-Shakhe-Nabat.jpg",
        singer: "مسیح و آرش",
        isLike: false,
        source: "Masih And Arash - Shakhe Nabat (320).mp3",
        duration: 157,
        lyric: `شاخه نبات من دیگه برات تا دم بهار نمیمونم
        شده هوا سرد و بیقرار ابر و باد بد آسمونم
        ببین زده به گلمون گرگ بعد رفتن تو برمون مرد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد
        ببین زده به گلمون گرگ بعد رفتن تو برمون مرد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد
        شده هرس درختای سبز بهار بارو بست تو کجایی پس
        شدن عوض آدمای شهر نگو تو هم عشقت بی فایدس
        ببین زده به گلمون گرگ بعد رفتن تو برمون مرد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد
        این آخرین قرار من بیقرار اگه تو نیای میمیرم
        اگه نیای تو سر قرار میمونه یه عمر تو سینم
        ببین زده به گلمون گرگ بعد رفتن تو برمون مرد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد
        ببین زده به گلمون گرگ بعد رفتن تو برمون مرد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد
        غمت سوزوند چایی باغو سیل تو تورو با ماهیا برد`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2022 17:58:00"),
      },
      {
        id: 11,
        name: "بهت قول میدم",
        img: "Mohsen-Yeganeh-Behet-Ghol-Midam-Dynatonic-DJ.jpg",
        singer: "محسن یگانه",
        isLike: false,
        source: "Behet Ghol Midam-joyamusic.mp3",
        duration: 217,
        lyric: `خودت میخوای بری خاطره شی اما دلت میسوزه
        تظاهر میکنی عاشقمی این بازی هر روزه نترس
        آدم دم رفتن همش دلشوره میگیره دو روز بگذره این دلشوره ها از خاطرت میره
        بهت قول میدم سخت نیست لااقل برای تو راحت باش دورم از تو و دنیا تو
        
        راحت باش هیچ کس نمیاد جای تو دلشوره دارم من واسه فردای تو
        بهت قول میدم سخت نیست لااقل برای تو راحت باش دورم از تو و دنیا تو
        راحت باش هیچ کس نمیاد جای تو دلشوره دارم من واسه فردای تو
        از عشق هر چیزی و که میشناسمو از من گرفتی تو باقیمونده احساسمو از من گرفتی
        میخوای من باشی و یادت بره مایی وجود داره خودت آماده رفتنی و ترست نمیذاره
        اصلا نترس راحت برو بی من هیچ کی به جز تو منو یادش نیست
        فکر کردی کی از من خبر داره راحت برو هیشکی حواسش نیست    
        بهت قول میدم سخت نیست لااقل برای تو راحت باش دورم از تو و دنیا تو
        راحت باش هیچ کس نمیاد جای تو دلشوره دارم من واسه فردای تو
        بهت قول میدم سخت نیست لااقل برای تو راحت باش دورم از تو و دنیا تو
        راحت باش هیچ کس نمیاد جای تو دلشوره دارم من واسه فردای تو
        مسیرمون با هم یکی بود ولی مقصد جدا دلگیرم پردرد پربغضم خدا`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2016 17:58:00"),
      },
      {
        id: 14,
        name: "رنگین کمون",
        img: "wlO5M1pz2KdVePN3BFkE.jpg",
        singer: "کسری زاهدی",
        isLike: false,
        source: "Kasra Zahedi - Rangin Kamoon (320).mp3",
        duration: 214,
        lyric: `بارون بارون بارونه؛ دل عاشقا خونه!
        تو نیای کارم تمومه! نیای کارم تمومه…
        بارون بارون بارونه؛ تو چشات رنگین کمونه
        تو نیای کارم تمومه؛ نیای کارم تمومه!
        آی نگار زیبا! آی تو که دوری از ما…
        
        شعر : حسین محمودی
        قرارمون تو ساحل؛ تنگ غروب دریا
        وای خبر خبر بیارید! که آرزوم تو راهه…
        تو این همه ستاره ؛ یکی یدونه ماهه
        وای خبر خبر بیارید! که آرزوم تو راهه…
        تو این همه ستاره ؛ یکی یدونه ماهه
        دلمو قدم قدم زدم به نامت
        قدم زدم به یادت، که بشم صاحب قلبت!
        که تو ساحل قلبت، بزنه بارون…
        کاش بزنه بارون… تازه شه دنیامون…
        خودمو به آب و آتیش زدم!
        هر بار من اصرار تو انکار! ولی انگار که نه انگار!
        نشستم تو این بار برسی از راه…
        آی برسی از راه… عمر غمت کوتاه…
        وای نگار زیبا! آی تو که دوری از ما…
        تنظیم قطعه : مسعود جهانی
        قرارمون تو ساحل؛ تنگ غروب دریا
        وای خبر خبر بیارید! که آرزوم تو راهه…
        تو این همه ستاره ؛ یکی یدونه ماهه
        وای خبر خبر بیارید! که آرزوم تو راهه…
        تو این همه ستاره ؛ یکی یدونه ماهه`,
        album: "تک آهنگ",
        publishDate: new Date("October 28, 2022 17:58:00"),
      },
      {
        id: 13,
        name: "باطل",
        img: "music2.jpg",
        singer: "شادمهر عقیلی",
        isLike: false,
        source: "Shadmehr Aghili - Batel.mp3",
        duration: 222,
        lyric: `هر چی گفتم بهت نرو
        نمیرسید بهت صدام
        تا کی بگردم تورو
        لایه بغض و گریه هام
        یاد تو میندازه منو
        هوای خیس این شهر
        لالایی میخونه بارون برام آروم نمیشم
        اون که با خود خواهیاش این عشقو باطل کرد بهم بگو تو بودی یا من
        اون که پامونو رفیق موج و ساحل کرد خودت بگو تو بودی یا من
        تو کجایی که الان دریا دلش تنگه ببینه ما دوتا رو با هم
        اون که با خود خواهیاش این عشقو باطل کرد بهم بگو تو بودی یا من
        اون که پامونو رفیق موج و ساحل کرد خودت بگو تو بودی یا من
        تو کجایی که الان دریا دلش تنگه ببینه ما دوتا رو با هم
        پایه های عشقمون روی یه مشت خاک بود
        تا اینجاشم خطرناک بود که رفتی و همش شد رو دلم آوار
        ترسم از این بود بگی بم تیکه های قلب مُردتو با دستای خودت بردار
        هر کاری کردم چهار دیواری دلم بشه خونت اما نشد
        من خبر دارم که گشتی مثل من یکی شه دیوونت پیدا نشد
        اون که با خود خواهیاش این عشقو باطل کرد بهم بگو تو بودی یا من
        اون که پامونو رفیق موج و ساحل کرد خودت بگو تو بودی یا من
        تو کجایی که الان دریا دلش تنگه ببینه ما دوتا رو با هم
        اون که با خود خواهیاش این عشقو باطل کرد بهم بگو تو بودی یا من
        اون که پامونو رفیق موج و ساحل کرد خودت بگو تو بودی یا من
        تو کجایی که الان دریا دلش تنگه ببینه ما دوتا رو با هم`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2021 17:58:00"),
      },
      {
        id: 2,
        name: "لیلا",
        img: "Alireza-Talischi-Leyla.jpg",
        singer: "علیرضا طلیسچی",
        isLike: false,
        source: "Alireza Talischi - Leyla (320).mp3",
        duration: 223,
        lyric: `آی لیلا لیلا لیلا لیلا لیلا یه گوشه چشمی بنداز بذار نیمه ی گمشدم دوباره بشه پیدا
        ای وای انگار تورو میخوامت الا بلا لیلا …
        لیلا بیا نازت کنم رو شونم احساست کنم هی از غریبه ها بگم یه خورده حساست کنم
        چشماتو آرایش کنی بزنم خرابش کنم کادوتو اخم کنی نخوای خودم برات بازش کنم
        آی لیلا لیلا لیلا لیلا لیلا یه گوشه چشمی بنداز بذار نیمه ی گمشدم دوباره بشه پیدا
        ای وای انگار تورو میخوامت الا بلا لیلا …
        آی لیلا لیلا لیلا لیلا لیلا یه گوشه چشمی بنداز بذار نیمه ی گمشدم دوباره بشه پیدا
        ای وای انگار تورو میخوامت الا بلا لیلا …
        لب دره باشم تو بگی واست میپرم تو اراده کنی دنیارم واست میخرم
        یه سفر با تو میچینم یه شمال تورو میبرم هر طرف تو باشی من به عشق تو اون ورم
        آی لیلا لیلا لیلا لیلا لیلا یه گوشه چشمی بنداز بذار نیمه ی گمشدم دوباره بشه پیدا
        ای وای انگار تورو میخوامت الا بلا لیلا …
        آی لیلا لیلا لیلا لیلا لیلا یه گوشه چشمی بنداز بذار نیمه ی گمشدم دوباره بشه پیدا
        ای وای انگار تورو میخوامت الا بلا لیلا ..`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2021 17:58:00"),
      },
      {
        id: 1,
        name: "ای دل غافل",
        img: "Alireza-Talischi-31571039501-Music-fa.com_.jpg",
        singer: "علیرضا طلیسچی",
        isLike: false,
        source: "Alireza Talischi - Ay Dele Ghafel.mp3",
        duration: 159,
        lyric: `ای دل غافل چیکار کردی تو با دل …
        نشون به اون نشونی خوب نشونی میکشونی دلو هر جا بخوای
        تو دلربایی کاش یه جوری میشد که بتونی با دلم راه بیای
        اگه من حرف حرف خودمه از ترسه که همه دنبالتن این رابطم چشم نخوره
        توی این شهر شلوغ آدم بد خیلی پره …
        ای دل غافل چیکار کردی تو با دل که دیگه عقلمو کامل دادم از دست
        ای دل غافل بکش منت عشقو بفهمون به دلش تو یه چیزیت هست
        یکی یدونم تویی چراغ خونم تویی غیر از خودتو ولش کن
        طرف حسابت منم مست و خرابت منم هرکیو اومد دکش کن آی دکش کن
        خندید خندید دلم هرجوری تنگید دیگه دست خودم نیست اگه فهمید اگه فهمید
        ای دل غافل چیکار کردی تو با دل که دیگه عقلمو کامل دادم از دست
        ای دل غافل بکش منت عشقو بفهمون به دلش تو یه چیزیت هست`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2020 17:58:00"),
      },
      {
        id: 3,
        name: "بغلم کن",
        img: "Reza-Ramyar-Baghalam-Kon.jpg",
        singer: "رضا رامیار",
        isLike: false,
        source: "mvc2.mp3",
        duration: 203,
        lyric: `ای وای دل من
        بعد عمری داره میخنده انگار دیگه نیست مال من
        تو بمون واسه من
        قول میده که سر به راه بشه آدم مغرور بد
        بیا بغلم کن (بغلم کن)
        بریز تو تن من همه ی اون درد دلارو
        بیا بس کن
        دنبالت بگرده قلب بی صاحب کجارو
        من بدنام عالم شم
        شبام همه ماتم شن
        محاله از دوتا چشمای مهربون تو رد شم
        تو باید مال من باشی
        آروم تنم باشی
        خوبه دیوونگی با تو نمیخوام دیگه آدم شم
        من بدنام عالم شم
        شبام همه ماتم شن
        محاله از دوتا چشمای مهربون تو رد شم
        تو باید مال من باشی
        آروم تنم باشی
        خوبه دیوونگی با تو نمیخوام دیگه آدم شم
        ای وای دل تو
        آروم جونم شد
        حوصله کن
        میشم همونی که تو عاشقشی
        تموم دلشی
        نه نمیگذره دل از تویی که پاره ی تنشی
        ول نکن قلبمو که از این عالم و آدماش بدجوری خستم
        جونی نمونده تو تنم تو بشو بال و پر قلبی که عمریه شکسته است
        من بد نام عالم شم
        شبام همه ماتم شن
        محاله از دوتا چشمای مهربون تو رد شم
        تو باید مال من باشی
        آروم تنم باشی
        خوبه دیوونگی با تو نمیخوام دیگه آدم شم
        من بد نام عالم شم
        شبام همه ماتم شن
        محاله از دوتا چشمای مهربون تو رد شم
        تو باید مال من باشی
        آروم تنم باشی
        خوبه دیوونگی با تو نمیخوام دیگه آدم شم
        `,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2018 17:58:00"),
      },
      {
        id: 4,
        name: "رمانتیک",
        img: "SogandRomantic.jpg",
        singer: "سوگند",
        isLike: false,
        source: "Sogand-Romantic.mp3",
        duration: 190,
        lyric: `تو شدی دلیل این که فراموش میکنم دردامو
        دره گوشت میزنم حرفهامو
        تویه چشم هات میبینم فردامو
        تو شدی دلیل این که دل من از همه دوره
        امشبو یادم میمونه
        نم نم بارون میزد قدم زدیم به سَمت خونه
        
        بگو یهویی از کجا پیدات شد
        تو جایی که همه چی‌ دراماتیک باشه
        فکرشم نمیکردم بشه با تو
        رابطمون اینقدر رمانتیک باشه
        
        گاهی وقتها خوبه عاشق بشه آدم
        گاهی وقتها یهویی میفته یادم
        یادته گل رُز قرمز به تو دادم
        کافیه نگاهش کنی‌ بیفتی یادم
        
        بگو یهویی از کجا پیدات شد
        تو جایی که همه چی‌ دراماتیک باشه فکرشم نمیکردم بشه با تو
        رابطمون اینقدر رمانتیک باشه
        سوگند
        `,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2019 17:58:00"),
      },
      {
        id: 5,
        name: "زندگی جونم",
        img: "Alireza-Talischi-Zendegi-Joonam.jpg",
        singer: "علیرضا طلیسچی",
        isLike: false,
        source: "Alireza Talischi - Zendegi Joonam (320).mp3",
        duration: 217,
        lyric: `درست تویی که تونستی منو درست کنی دیگه هیشکی تو دلم به جز تو نی به جز تو نی
        تو قلبمی عشقم من شدی خودت بخوای نخوای عشق من فقط خودت به من میای به من میای
        خود ماه انقد ماه نی که تو انقد ماهی دیگه هیچ وقت با هیشکی نمیشه
        میمیرم من بی تو توی قلبمی تو یکی چقدر میتونه زندگی شه
        زندگی جونم من بدون تو یه لحظه ام نمیتونم قبل تو یادم نمیادش نمیدونم
        تو منم عین خودت کردی که دیوونم هم که دیوونم
        زندگی جونم من بدون تو یه لحظه ام نمیتونم قبل تو یادم نمیادش نمیدونم
        تو منم عین خودت کردی که دیوونم هم که دیوونم
        دیدم که میگم بعد تو کسی ام قد تو جا وا نکردش تو دلم
        اینو راحت بگم قفلم رو حسایی که من با دلم بهت دارم بهت دارم
        هیشکی برام مثل تو نی تو که باعث شدی چشمامون هیچ جایی نره
        چقدرم بهتره اینجوری حال هردومون تو رو دوست دارم دوست دارم
        زندگی جونم من بدون تو یه لحظه ام نمیتونم قبل تو یادم نمیادش نمیدونم
        تو منم عین خودت کردی که دیوونم هم که دیوونم
        زندگی جونم من بدون تو یه لحظه ام نمیتونم قبل تو یادم نمیادش نمیدونم
        تو منم عین خودت کردی که دیوونم هم که دیوونم`,
        album: "تک آهنگ",
        publishDate: new Date("October 1, 2020 17:58:00"),
      },
      {
        id: 50,
        name: "برای",
        img: "6050-Shervin-Hajipor-Baraye.png",
        singer: "شروین حاجی پور",
        isLike: false,
        source: "Shervin Hajipour - Baraye (320-Naslemusic).mp3",
        duration: 151,
        lyric: `برای ترسیدن به وقت بوسیدن
        برای تغییر مغزها که پوسیدن
        برای شرمندگی برای بی پولی
        برای حسرت یک زندگی معمولی
        برای کودک زباله گرد و آرزوهاش
        برای این اقتصاد دستوری
        برای این هوای آلوده
        برای ولیعصر و درخت های فرسوده
        برای پیروز و احتمال انقراضش
        برای سگ های بی گناه ممنوعه
        برای گریه های بی وقفه
        برای تصویر تکرار این لحظه
        برای چهره ای که میخنده
        برای دانش آموزا برای آینده
        برای نخبه های زندانی
        برای کودکان افغانی
        برای این همه برای غیر تکراری
        برای این همه شعارهای توخالی
        برای آوار خونه های پوشالی
        برای احساس آرامش
        برای خورشید پس از شبای طولانی
        برای قرص های اعصاب و بی خوابی
        برای دختری که آرزو داشت پسر بود
        برای زن زندگی آزای`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2022 17:58:00"),
      },
      {
        id: 60,
        name: "عاشق",
        img: "Siavash Ghomayshi - Ashegh.jpg",
        singer: "سیاوش قمیشی",
        isLike: false,
        source: "Siavash Ghomayshi  - Ashegh.mp3",
        duration: 280,
        lyric: `تو عاشق نبودی که درد دل عاشقا رو بفهمی
        تو بارون نموندی که دلگیریه این هوارو بفهمی
        تو گریه نکردی برای کسی تا بدونی چی میگم
        دلت تنگ نبوده میخندی تا از حس دلتنگی میگم
        تو تنها نموندی که حال دل بیقرارو بفهمی
        عزیزت نرفته که تشویش سوت قطارو بفهمی
        تو از دست ندادی بفهمی چیه ترس از دست دادن
        جای من نبودی بدونی چیه فرق بین تو و من
        تو هیچوقت نرفتی لب جاده تا انتظارو بفهمی
        پریشون نبودی که نگذشتن لحظه هارو بفهمی
        تو اونی که رفته چی میدونی از غصه جای خالی
        من اونم که مونده چی میدونم از قصه بی خیالی`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2022 17:58:00"),
      },
      {
        id: 700,
        name: "قاف",
        img: "Alireza-Talischi-Ghaaf.jpg",
        singer: "علیرضا طلیسچی",
        isLike: false,
        source: "Alireza Talischi - Ghaf.mp3",
        duration: 203,
        lyric: `بارون اومد و یادم داد؛ تو زورت بیشتره!
        ممکنه هر دفعه اونجوری؛ که میخواستی پیش نره…
        خاطره هام داره، خوابو میگیره ازم!
        دوری و من دیگه ته دنیام؛ قلبت نوک قله ی قافه
        من که تو زندگیم هیشکی نیست؛ چه دروغی دارم بگم آخه؟!
        
        شعر و ملودی : علیرضا طلیسچی
        این همه دوری، نه واسه تو خوبه نه من…
        طرف تو بارون نمیاد؛ نمیشی دلتنگ زیاد!
        میدونی چند وقته دلم تورو میخواد؟!
        اینجوری نکن با من هی دوری نکن با من
        این شوخی خوبی نیست! من بی تو میمیرم واقعا!
        اینجوری نرو سخته… چرا قلب تو بی رحمه؟
        کی غیر تو با قلبش؛ این حال منو میفهمه؟
        موندم با اشک و آهم؛ با چشمای چشم به راهم!
        کاشکی میشد یه قیچی؛ میخورد رو خاطرات با هم!
        من دوست دارم؛ این بده دوریت ازم

        تنظیم قطعه : امیربهادر دهقان
        اینقده که زندم، به زور یه رویای دور!
        اینجوری نکن با من هی دوری نکن با من
        این شوخی خوبی نیست! من بی تو میمیرم واقعا!
        اینجوری نرو سخته… چرا قلب تو بی رحمه؟
        کی غیر تو با قلبش؛ این حال منو میفهمه؟`,
        album: "تک آهنگ",
        publishDate: new Date("October 18, 2022 17:58:00"),
      },
    ],
    hot_musics: [
      {
        id: 10,
        name: "ندارمت",
        img: "Mohsen-Yeganeh-Nadaramet.jpg",
        singer: "محسن یگانه",
      },
      {
        id: 11,
        name: "بهت قول میدم",
        img: "Mohsen-Yeganeh-Behet-Ghol-Midam-Dynatonic-DJ.jpg",
        singer: "محسن یگانه",
      },
      {
        id: 12,
        name: "شاخه نبات",
        img: "Masih-Arash-Shakhe-Nabat.jpg",
        singer: "مسیح و آرش",
      },
      {
        id: 13,
        name: "باطل",
        img: "music2.jpg",
        singer: "شادمهر عقیلی",
      },
      {
        id: 14,
        name: "رنگین کمون",
        img: "wlO5M1pz2KdVePN3BFkE.jpg",
        singer: "کسری زاهدی",
      },
    ],
    new_musics: [
      {
        id: 1,
        name: "ای دل غافل",
        img: "Alireza-Talischi-31571039501-Music-fa.com_.jpg",
        singer: "علیرضا طلیسچی",
      },
      {
        id: 2,
        name: "لیلا",
        img: "Alireza-Talischi-Leyla.jpg",
        singer: "علیرضا طلیسچی",
      },
      {
        id: 3,
        name: "بغلم کن",
        img: "Reza-Ramyar-Baghalam-Kon.jpg",
        singer: "رضا رامیار",
      },
      {
        id: 50,
        name: "برای",
        img: "6050-Shervin-Hajipor-Baraye.png",
        singer: "شروین حاجی پور",
      },
      {
        id: 5,
        name: "زندگی جونم",
        img: "Alireza-Talischi-Zendegi-Joonam.jpg",
        singer: "علیرضا طلیسچی",
      },
    ],
    mostPopularMusics: [
      {
        id: 1,
        name: "ندارمت",
        img: "Mohsen-Yeganeh-Nadaramet.jpg",
        singer: "علیرضا طلیسچی",
        like: 365,
        view: 7981,
      },
      {
        id: 1,
        name: "شاخه نبات",
        img: "Masih-Arash-Shakhe-Nabat.jpg",
        singer: "علیرضا طلیسچی",
        like: 345,
        view: 6981,
      },
      {
        id: 1,
        name: "بهت قول میدم",
        img: "Mohsen-Yeganeh-Behet-Ghol-Midam-Dynatonic-DJ.jpg",
        singer: "علیرضا طلیسچی",
        like: 325,
        view: 6181,
      },
      {
        id: 1,
        name: "ای دل غافل",
        img: "Alireza-Talischi-31571039501-Music-fa.com_.jpg",
        singer: "علیرضا طلیسچی",
        like: 300,
        view: 6981,
      },
      {
        id: 1,
        name: "بغلم کن",
        img: "Reza-Ramyar-Baghalam-Kon.jpg",
        singer: "علیرضا طلیسچی",
        like: 265,
        view: 1481,
      },
      {
        id: 1,
        name: "زندگی جونم",
        img: "Alireza-Talischi-Zendegi-Joonam.jpg",
        singer: "علیرضا طلیسچی",
        like: 165,
        view: 4981,
      },
      {
        id: 1,
        name: "بهت قول میدم",
        img: "Mohsen-Yeganeh-Behet-Ghol-Midam-Dynatonic-DJ.jpg",
        singer: "علیرضا طلیسچی",
        like: 165,
        view: 981,
      },
    ],
    isMusicPlaying: false,
    musicPlayer: {
      tracks: [],
      playlistName: "",
      currentMusicIndex: 0,
      isPlaylistEnd: false,
      pauseMusicPlayer: true,
    },
    currentMusic: {},
  },

  getters: {
    relatedMusics(state) {
      return state.all_musics.filter(
        (music) => music.id !== state.currentMusic.id
      );
    },
  },

  mutations: {
    SET_PLAYING_MUSIC(state, data) {
      state.playing_music = data;
    },
    SET_TOP_MUSICS(state, data) {
      state.top_musics = data;
    },
    SET_NEW_MUSICS(state, data) {
      state.new_musics = data;
    },
    PLAY_MUSIC(state, musics) {
      state.musicPlayer.tracks = Array.isArray(musics) ? [...musics] : [musics];
      state.isMusicPlaying = true;
      state.musicPlayer.isPlaylistEnd = false;
    },
    PAUSE_MUSIC(state) {
      state.isMusicPlaying = false;
    },
    SET_CURRENT_MUSIC(state, music) {
      state.currentMusic = music;
    },

    LIKE_TOGGLE(state) {
      state.currentMusic.isLike = !state.currentMusic.isLike;
    },

    EDIT_MUSIC(state, musicInfos) {
      state.currentMusic.name = musicInfos.musicName;
      state.currentMusic.singer = musicInfos.musicSinger;
      state.currentMusic.lyric = musicInfos.musicLyric;
      state.currentMusic.img = musicInfos.musicImg;
      state.currentMusic.album = musicInfos.musicAlbum;
    },

    SET_MUSIC_PLAYER_CURRENT_MUSIC_INDEX(state, musicIndex) {
      state.musicPlayer.currentMusicIndex = musicIndex;
    },

    SET_MUSIC_PLAYER_PLAYLIST(state, playlistName) {
      state.musicPlayer.playlistName = playlistName;
      state.musicPlayer.isPlaylistEnd = false;
    },

    SET_END_PLAY_LIST_STATE(state) {
      state.musicPlayer.isPlaylistEnd = true;
    },

    PLAYLIST_REPLAYED(state) {
      state.musicPlayer.isPlaylistEnd = false;
    },

    SETING_MUSIC_PLAYER_TO_PLAY(state) {
      state.musicPlayer.pauseMusicPlayer = false;
    },

    SETING_MUSIC_PLAYER_TO_PAUSE(state) {
      state.musicPlayer.pauseMusicPlayer = true;
    },
  },

  actions: {
    playMusic(context, musicId) {
      // get music from api---------------
      const music = context.state.all_musics.find(
        (music) => music.id === Number(musicId)
      );
      // -----------------
      context.commit("PLAY_MUSIC", music);
      context.commit("SET_MUSIC_PLAYER_PLAYLIST", "");
    },
    pauseMusic(context) {
      context.commit("PAUSE_MUSIC");
    },
    getMusicById(context, musicId) {
      // get music from api---------------
      const music = context.state.all_musics.find(
        (music) => music.id === Number(musicId)
      );
      context.commit("SET_CURRENT_MUSIC", music);
      //-----------------
    },

    likeToggle(context) {
      //
      // like api
      //
      context.commit("LIKE_TOGGLE");
    },

    editMusic(context, musicInfos) {
      //
      // call API
      //
      context.commit("EDIT_MUSIC", musicInfos);
    },

    removeMusic(context) {
      // call API
      console.log(context);
    },

    playPlaylist(context, playlist) {
      context.commit("SET_MUSIC_PLAYER_PLAYLIST", playlist.name);
      context.commit("PLAY_MUSIC", playlist.musics);
    },

    setMusicPlayerCurrentMusicIndex(context, musicIndex) {
      context.commit("SET_MUSIC_PLAYER_CURRENT_MUSIC_INDEX", musicIndex);
    },

    setEndPlaylistState(context) {
      context.commit("SET_END_PLAY_LIST_STATE");
    },

    playlistReplayed(context) {
      context.commit("PLAYLIST_REPLAYED");
    },

    setingMusicplayerToPlay(context) {
      context.commit("SETING_MUSIC_PLAYER_TO_PLAY");
    },

    setMusicPlayerToPause(context) {
      context.commit("SETING_MUSIC_PLAYER_TO_PAUSE");
    },
  },
};

export default musics;
